[
    {
        "title": "Senior AI Engineer",
        "company": "Catalant",
        "location": "🇺🇸 United States",
        "url": "https://remoteok.io/remote-jobs/remote-senior-ai-engineer-catalant-1093849",
        "source": "Remote OK",
        "description": "Catalant\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tApply now\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t👀 243 views\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t✅ 17 applied\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(7%)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tShare this job:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nGet a \nrok.co\n short link\n\n\n\n\n\n\n\n\nCatalant is hiring a \n\n\nRemote Senior AI Engineer\n\n\n\n\n\\nAs the pioneer of Consulting 2.0, Catalant gives the world’s leading companies on-demand access to a community of highly vetted independent consultants and former operators. From individual consultants to full project teams, we deliver the right expertise to solve our clients’ most important challenges. Our clients include more than 30% of the Fortune 500, top private equity firms, and global consultancies, all seeking a more flexible, cost-effective way to get high-impact work done.\\n\\n\\nWe’ve reimagined consulting for today’s world: it’s digitally enabled, fit-for-purpose, and designed to deliver outcomes, not just hours. Our proprietary platform powers our ability to connect companies with Catalant Experts and Teams who’ve solved similar problems before. Backed by world-class venture investors, we’re building the team that will take Catalant and the future of consulting to the next level.\\n\\n\\n\\n\\nWe're looking for an AI Engineer to drive innovation across our platform and within our business. You’ll build AI-powered capabilities that provide industry-leading user experiences and help our clients and expert community achieve results faster, while also enabling Catalant’s internal team to work smarter and hit our growth targets. \\n\\n\\n\\nWhat you'll do\\n* Help drive adoption of AI on the Catalant platform and within our business, including:\\n* AI Feature Development: Build and deploy enterprise-ready, AI-driven features that harness Catalant’s rich data to optimize our technology platform and internal workflows.\\n* Building GenAI Systems With Cutting-Edge Design Patterns: Create and maintain systems that use technologies like advanced RAG, agents, and others to provide precise, contextually relevant information across our technology platform and internal processes.\\n* Data Infrastructure: Team with data engineering to help ensure Catalant’s AI-focused data infrastructure is properly evolving, integrating multiple data sources into a robust, highly optimized data warehouse tailored specifically for AI applications.\\n\\n\\n\\n* Technical ownership over AI project lifecycles - own the projects you work on from planning to execution, with a team of friendly and helpful engineers that will provide assistance and feedback along the way.\\n\\n\\n\\n* Work cross-functionally by partnering with product, design, data analytics, business systems, etc. to plan and gather requirements for projects.\\n\\n\\n\\n* Deliver new product features to our clients quickly with a focus on accuracy, quality, usability, performance, and scalability\\n\\n\\n\\nWhat you'll bring\\n* At least 8-years of professional software engineering  experience, including 4+ years focused on generative AI and ML systems.\\n* Hands-on experience bringing AI solutions to production in an enterprise setting (i.e., you don’t just write code in notebooks)\\n* Integrating LLM APIs into responsive, real-time applications\\n* Hands on, professional experience with common genAI design patterns, such as RAG, agentic systems, evals,  model fine-tuning\\n* Familiarity with a variety of genAI models and frameworks\\n* Familiar with basic AI/ML concepts such as collection and utilization of testing/training data, validation and testing; basic ML algorithms; and an understanding of how LLMs work\\n* Grounding in data science fundamentals, such as regression analysis, cross-validation, and techniques to address overfitting and underfitting\\n* Experience in the full lifecycle of enterprise AI projects, including evaluation, guardrails, and monitoring, and maintaining AI systems in production. \\n* Experience in MLOps / deploying models locally with GPUs and packages such as pytorch is a plus\\n* Ability to work with stakeholders to understand requirements, collecting and incorporating feedback during and after deployment\\n* Knowledge of OOP language(s);  Deep and demonstrated python fluency required. \\n* Deep working knowledge of one or more gen AI frameworks (such as Langgraph, LlamaIndex, or others)\\n* Experience working with relational and vector databases; MySQL and Databricks experience a plus.\\n* Demonstrated experience staying up to date with industry developments \\n* Excitement about coaching peers in a constructive and positive way and ability to lead technically while also working independently and showing initiative to make an impact\\n* Strong partnership with company leadership, engineering peers, product, and design during requirement discovery and solutioning\\n* Ability to work with urgency, a strong sense of curiosity, and demonstrated ability to learn new technologies.\\n\\n\\n\\n\\n\\n\\nAbout Catalant's Engineering Team:\\n\\n\\nWe value collaboration and teamwork, and strive for pragmatic solutions. We’re a Python shop on the Flask framework.  We use docker, MySQL , Elasticsearch, and some VueJS deployed in GCP.  We leverage CI and CD. We utilize the  scrum framework to develop new features and platform improvements for our clients.  New engineers typically deploy their first production code in their first week on the job.  If you get stuck on a problem, your team is right there to help get you moving again. We are excited to be adding an engineer to our team that can help us bring our application to the next level while solving some of the interesting challenges we are addressing.\\n\\n\\nOur team values diversity in experience and backgrounds—we do our best work when we create space for different voices and perspectives. Whatever unique experiences or skill sets you bring, we look forward to learning from each other.\\n\\n\\nBenefits \\n\\n\\nAt Catalant, we strive to offer a work environment where employees can bring however much of their full, authentic self as they desire. With this in mind, we are happy to offer our employees: \\n- Flexible paid time off\\n- 13 company holidays + a week off from Christmas through New Years\\n- Twelve weeks of paid parental leave regardless of how you choose to grow your family\\n- Generous health insurance coverage as well as optional vision and dental\\n- 401k to save for retirement\\n- Pre-tax commuter and flexible spending accounts\\n- A lifestyle spending account to be used towards cell phone, internet, commuting, and learning & development \\n- Wellness stipend for your mental, emotional, or physical wellbeing needs and support\\n- Work from Home stipend\\n\\n\\n\\n\\nEqual Employment Opportunity Policy\\nCatalant is proud to be an equal opportunity workplace. Catalant makes employment decisions on the basis of merit and business objectives and does not discriminate against applicants or employees on the basis of age, race, color, religion, national origin, ancestry, gender (including gender nonconformity and status as a transgender individual), sexual orientation, pregnancy, marital status, military or veteran status, qualified physical or mental disability, genetic condition or predisposition, or any other status protected by law. All Catalant employees are prohibited from engaging in any form of discrimination.\\n\\n\\n\\n\\nWe have a flexible hybrid work model, where employees local to our Boston headquarters come into our office on a flexible basis, and other employees are fully remote. We are hiring and conducting interviews and onboarding either virtually or in person if local to Boston, depending on what makes most sense based on the specific candidate and new hire. Talk to our People Team to learn more!\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Salary and compensation\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo salary data published by company so we estimated salary based on similar jobs related to Design, Python, Consulting, Senior and Engineer jobs that are similar:\\n\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $60,000 — $150,000/year\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Benefits\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t💰 401(k)\\n\\n🌎 Distributed team\\n\\n⏰ Async\\n\\n🤓 Vision insurance\\n\\n🦷 Dental insurance\\n\\n🚑 Medical insurance\\n\\n🏖 Unlimited vacation\\n\\n🏖 Paid time off\\n\\n📆 4 day workweek\\n\\n💰 401k matching\\n\\n🏔 Company retreats\\n\\n🏬 Coworking budget\\n\\n📚 Learning budget\\n\\n💪 Free gym membership\\n\\n🧘 Mental wellness budget\\n\\n🖥 Home office budget\\n\\n🥧 Pay in crypto\\n\\n🥸 Pseudonymous\\n\\n💰 Profit sharing\\n\\n💰 Equity compensation\\n\\n⬜️ No whiteboard interview\\n\\n👀 No monitoring system\\n\\n🚫 No politics at work\\n\\n🎅 We hire old (and young)\\n\\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Location\\nBoston or Remote, US",
        "years_of_experience": "N/A",
        "date_posted": "1d",
        "work_type": "Remote",
        "annual_base": "N/A",
        "type": "N/A",
        "level": "N/A"
    },
    {
        "title": "Senior Full Stack Engineer",
        "company": "Snowplow Analytics",
        "location": "🇵🇱 Poland",
        "url": "https://remoteok.io/remote-jobs/remote-senior-full-stack-engineer-snowplow-analytics-1093846",
        "source": "Remote OK",
        "description": "Snowplow Analytics\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tApply now\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t👀 404 views\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t✅ 47 applied\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(12%)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tShare this job:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nGet a \nrok.co\n short link\n\n\n\n\n\n\n\n\nSnowplow Analytics is hiring a \n\n\nRemote Senior Full Stack Engineer\n\n\n\n\n\\nSenior Full-Stack Engineer\\n\\n\\nPoland/Remote\\n\\n\\n#LI-Remote\\n\\n\\nAbout Snowplow:\\n\\n\\nSnowplow is the global leader in customer data infrastructure for AI, enabling every organization to transform raw behavioral data into governed, high-fidelity fuel for AI-powered applications—including advanced analytics, real-time personalization engines, and AI agents.\\n\\n\\nDigital-first companies like Strava, HelloFresh, Auto Trader, Burberry, and DPG Media use Snowplow to collect and process event-level data in real time, delivering it securely to their warehouse, lake, or stream, and integrate deep customer context into their applications.\\n\\n\\nThousands of companies rely on Snowplow to uncover customer insights, predict customer behaviors, hyper-personalize customer experiences, and detect fraud in real time.\\n\\n\\nThe Opportunity:\\n\\n\\nWe are looking for a Senior full-stack engineer with experience in Scala and React to join our Data Products team at Snowplow. The Data Products team enables customers to rapidly create, govern, and iterate on high-quality behavioral data products that fuel AI-powered applications. We transform the complex process of data creation from weeks to days through intuitive design tools, automated code generation, and comprehensive governance capabilities.\\n\\n\\nWe believe in supporting engineers to have autonomy and responsibility to make decisions, taking ownership of the product from technical design to code to customer. The ideal fit will be an engineer who loves to learn and take on new challenges, and can solve a variety of problems to ensure the success of the overall service, in partnership with our product and customer-facing teams.\\n\\n\\nIf you are growth-oriented, passionate about technology, and excited about building exceptional UIs and complex business services, we want to hear from you!\\n\\n\\nWhat you’ll be doing:\\n\\n\\n● Working on our Typelevel Scala backend services and our React single-page application.\\n● Embracing AI coding assistants to delegate the boring, repetitive tasks while focusing on the creative, important work. We believe in AI as an enabler of velocity improvements, while being cognizant of the constraints; and deploy its strengths intentionally.\\n● Building robust QA, unit and integration tests.\\n● Writing top documentation about the features you help deliver.\\n● Taking turns to investigate our customers’ escalated tickets and respond (we don’t do on-call rotations, not yet at least).\\n● Collaborating in Scrum ceremonies and engage with cross-functional teams for requirements.\\n● Managing CI/CD pipelines for automated deployments and reliability.\\n● Monitoring system health with observability tools and address issues proactively.\\n● Engaging with stakeholders for alignment on project goals and updates.\\n● Researching new technologies to improve the Snowplow ecosystem.\\n\\n\\nWe’d love to hear from you if:\\n\\n\\n● You have professional experience building 1) RESTful APIs with Typelevel Scala, and 2) engaging user experiences for the Web with Typescript and React.\\n● You understand API and browser performance, as well as web accessibility standards. \\n● You have an array of tools under your belt to support making a web application faster and more accessible.\\n● You place maximum emphasis on security. Data security and integrity are fundamental to what we do, so you’ll need a solid understanding of security threats and how to overcome them.\\n● Nice to have, not necessary: Golang and Python experience would come very handy, for a few repositories outside of the critical path.\\n\\n\\nWhat We Offer You in Return:\\n\\n\\n💰 A competitive package, including share options\\n🧘 Flexible working\\n🏖 A generous holiday allowance no matter where you are in the world\\n💻 MacBook and home office equipment allowance\\n👪 Enhanced maternity, paternity, shared parental and adoption leave\\n\\n\\n\\n\\n\\n\\nSnowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don't discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.\\n\\n\\nEmployment is conditional upon the successful completion of background screening and verification of right-to-work documentation in accordance with applicable laws.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Salary and compensation\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo salary data published by company so we estimated salary based on similar jobs related to Design, React, Python, Typescript, API, Senior, Golang, Engineer and Backend jobs that are similar:\\n\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $60,000 — $120,000/year\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Benefits\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t💰 401(k)\\n\\n🌎 Distributed team\\n\\n⏰ Async\\n\\n🤓 Vision insurance\\n\\n🦷 Dental insurance\\n\\n🚑 Medical insurance\\n\\n🏖 Unlimited vacation\\n\\n🏖 Paid time off\\n\\n📆 4 day workweek\\n\\n💰 401k matching\\n\\n🏔 Company retreats\\n\\n🏬 Coworking budget\\n\\n📚 Learning budget\\n\\n💪 Free gym membership\\n\\n🧘 Mental wellness budget\\n\\n🖥 Home office budget\\n\\n🥧 Pay in crypto\\n\\n🥸 Pseudonymous\\n\\n💰 Profit sharing\\n\\n💰 Equity compensation\\n\\n⬜️ No whiteboard interview\\n\\n👀 No monitoring system\\n\\n🚫 No politics at work\\n\\n🎅 We hire old (and young)\\n\\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Location\\nPoland",
        "years_of_experience": "N/A",
        "date_posted": "1d",
        "work_type": "Remote",
        "annual_base": "N/A",
        "type": "N/A",
        "level": "N/A"
    },
    {
        "title": "Junior Network Engineer",
        "company": "Kyivstar",
        "location": "All",
        "url": "https://remoteok.io/remote-jobs/remote-junior-network-engineer-kyivstar-1093845",
        "source": "Remote OK",
        "description": "Kyivstar\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tApply now\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t👀 534 views\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t✅ 70 applied\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(13%)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tShare this job:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nGet a \nrok.co\n short link\n\n\n\n\n\n\n\n\nKyivstar is hiring a \n\n\nRemote Junior Network Engineer\n\n\n\n\n\\nWe are looking for a Junior Network Engineer\\n\\n\\nAbout us \\n\\n\\nKyivstar.Tech is a Ukrainian hybrid IT company and a resident of Diia.City. We are a subsidiary of Kyivstar, one of Ukraine's largest telecom operators. \\n \\nOur mission is to change lives in Ukraine and around the world by creating technological solutions and products that unleash the potential of businesses and meet users' needs. \\n \\nOver 600+ KS.Tech specialists work daily in various areas: mobile and web solutions, as well as design, development, support, and technical maintenance of high-performance systems and services. \\n \\nWe believe in innovations that truly bring quality changes and constantly challenge conventional approaches and solutions. Each of us is an adherent of entrepreneurial culture, which allows us never to stop, to evolve, and to create something new. \\n\\n\\n\\n What you will do\\n* Corporate datacenters and regional offices LAN/WAN network services development and support\\n* Corporate wireless network (Wi-Fi) services development and support\\n* Network equipment and services troubleshooting/monitoring\\n* NetOps documentation/processes/procedures/knowledge base management\\n\\n\\n\\nQualifications and experience needed\\n* Basic understanding of network protocols and concepts such as TCP/IP, DHCP, DNS, and OSI model\\n* Familiarity with configuring and troubleshooting network devices like switches and routers(based on IOS, NXOS)\\n* Eagerness to contribute to network troubleshooting and optimization tasks\\n* Basic knowledge of scripting languages like Python or Bash is a plus\\n* Enthusiasm for learning and adapting to new network technologies and practices\\n\\n\\n\\nA plus would be \\n* Any network related certification\\n* Experience with Unix (RedHat, FreeBSD, Debian, CentOS)\\n* Basic English language skills for reading technical documents and communicating\\n\\n\\n\\nWhat we offer \\n* Office or remote – it’s up to you. You can work from anywhere, and we will arrange your workplace \\n* Remote onboarding  \\n* Performance bonuses for everyone (annual or quarterly — depends on the role)  \\n* We train employees: with the opportunity to learn through the company’s library, internal resources, and programs from partners   \\n* Health and life insurance  \\n* Wellbeing program and corporate psychologist  \\n* Reimbursement of expenses for Kyivstar mobile communication \\n\\n\\n\\n\\n\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Salary and compensation\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo salary data published by company so we estimated salary based on similar jobs related to Python, Mobile, Junior and Engineer jobs that are similar:\\n\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $60,000 — $122,500/year\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Benefits\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t💰 401(k)\\n\\n🌎 Distributed team\\n\\n⏰ Async\\n\\n🤓 Vision insurance\\n\\n🦷 Dental insurance\\n\\n🚑 Medical insurance\\n\\n🏖 Unlimited vacation\\n\\n🏖 Paid time off\\n\\n📆 4 day workweek\\n\\n💰 401k matching\\n\\n🏔 Company retreats\\n\\n🏬 Coworking budget\\n\\n📚 Learning budget\\n\\n💪 Free gym membership\\n\\n🧘 Mental wellness budget\\n\\n🖥 Home office budget\\n\\n🥧 Pay in crypto\\n\\n🥸 Pseudonymous\\n\\n💰 Profit sharing\\n\\n💰 Equity compensation\\n\\n⬜️ No whiteboard interview\\n\\n👀 No monitoring system\\n\\n🚫 No politics at work\\n\\n🎅 We hire old (and young)\\n\\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Location\\nAll",
        "years_of_experience": "N/A",
        "date_posted": "1d",
        "work_type": "Remote",
        "annual_base": "N/A",
        "type": "N/A",
        "level": "N/A"
    },
    {
        "title": "Principal Engineer",
        "company": "Find",
        "location": "🌏 Probably worldwide",
        "url": "https://remoteok.io/remote-jobs/remote-principal-engineer-find-1093844",
        "source": "Remote OK",
        "description": "Find\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tApply now\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t👀 352 views\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t✅ 40 applied\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(11%)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tShare this job:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nGet a \nrok.co\n short link\n\n\n\n\n\n\n\n\nFind is hiring a \n\n\nRemote Principal Engineer\n\n\n\n\n\\nWe are seeking a Principal Engineer to join the founding team of our Performance Affiliate Network platform. This is a high-impact role where you will lead architecture decisions, own system-level technical strategy, and deliver key features across an AI-integrated affiliate tech stack. You'll work closely with Product, Growth, and other engineering teams to build resilient systems that scale for use cases like agent-based automation, channel integrations, and data ingestion.\\n\\n\\n\\nResponsibilities\\n* Design and develop full-stack features using TypeScript (NestJS, NextJS, React) and Python.\\n* Lead the implementation of microservices and event-driven orchestration patterns to support data-rich, real-time affiliate workflows.\\n* Architect and deploy AI agent systems using frameworks like LangChain, custom RAG pipelines, and vector databases.\\n* Build and maintain web scraping pipelines using Apify or custom frameworks, ensuring reliability, throughput, and compliance.\\n* Integrate bots and connectors across messaging and web platforms (e.g., Discord, Telegram).\\n* Ensure observability (metrics, logs, traces), CI/CD health, and secure cloud infrastructure (AWS + Terraform, GitHub Actions, Argo CD).\\n* Drive internal technical quality through unit testing (≥ 80% coverage), functional testing, and end-to-end testing, while actively managing critical technical debt.\\n* Collaborate with the Tech Lead and non-technical teams through pair programming, reviews, and demos.\\n* Evaluate and incorporate emerging technologies in AI, LLMs, and automation to continuously improve product capabilities.\\n\\n\\n\\nRequirements\\n* 5+ years of full-stack experience building and scaling production-grade web platforms.\\n* Expertise in TypeScript (Node.js, NestJS, React) and proficiency in Python (FastAPI).\\n* Hands-on experience with AI agent frameworks (e.g., LangChain), vector stores, and RAG workflows.\\n* Proven ability to design and deploy scalable scraping systems using tools like Apify.\\n* Familiarity with messaging or bot development ecosystems (e.g., Discord.js, Telegraf).\\n* Solid understanding of relational (PostgreSQL) and non-relational (e.g., MongoDB) databases; comfortable modeling for both transactional and unstructured data.\\n* Experience building event-driven architectures using Kafka, Kinesis, RabbitMQ, or similar.\\n* Strong debugging, profiling, and performance optimization skills across the full stack.\\n* A degree in Computer Science, Engineering, or a related technical field is preferred\\n\\n\\nNice to Have\\n* Experience in affiliate, fintech, gaming, or other high-compliance domains.\\n* Exposure to LLMs, embeddings, vector search (e.g., Pinecone), and tool/agent chaining logic.\\n* Familiarity with observability tooling (Grafana, Prometheus, DataDog) and incident response practices.\\n* Knowledge of privacy, data compliance, and secure coding standards (e.g., GDPR, ISO 27001).\\n* Proficiency with CI/CD, infrastructure-as-code (Terraform), and cloud-native deployment on AWS.\\n* Contributions to open-source AI or development projects.\\n\\n\\n\\n\\n\\n\\nFind.co is an Equal Opportunity / Affirmative Action employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state, or local laws.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Salary and compensation\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo salary data published by company so we estimated salary based on similar jobs related to Design, Python, Typescript and Engineer jobs that are similar:\\n\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $60,000 — $147,500/year\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\\n\\n#Benefits\\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t💰 401(k)\\n\\n🌎 Distributed team\\n\\n⏰ Async\\n\\n🤓 Vision insurance\\n\\n🦷 Dental insurance\\n\\n🚑 Medical insurance\\n\\n🏖 Unlimited vacation\\n\\n🏖 Paid time off\\n\\n📆 4 day workweek\\n\\n💰 401k matching\\n\\n🏔 Company retreats\\n\\n🏬 Coworking budget\\n\\n📚 Learning budget\\n\\n💪 Free gym membership\\n\\n🧘 Mental wellness budget\\n\\n🖥 Home office budget\\n\\n🥧 Pay in crypto\\n\\n🥸 Pseudonymous\\n\\n💰 Profit sharing\\n\\n💰 Equity compensation\\n\\n⬜️ No whiteboard interview\\n\\n👀 No monitoring system\\n\\n🚫 No politics at work\\n\\n🎅 We hire old (and young)\\n\\n",
        "years_of_experience": "N/A",
        "date_posted": "2d",
        "work_type": "Remote",
        "annual_base": "N/A",
        "type": "N/A",
        "level": "N/A"
    },
    {
        "title": "Senior Elixir Engineer",
        "company": "Sanctuary Computer",
        "location": "🌏 Worldwide",
        "url": "https://remoteok.io/remote-jobs/remote-senior-elixir-engineer-sanctuary-computer-1093807",
        "source": "Remote OK",
        "description": "Sanctuary Computer\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tApply now\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t👀 1,273 views\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t✅ 85 applied\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(7%)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tShare this job:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nGet a \nrok.co\n short link\n\n\n\n\n\n\n\n\nSanctuary Computer is hiring a \n\n\nRemote Senior Elixir Engineer\n\n\n\n\nOriginal job post link:\nSenior Elixir Engineer Original Job Post Link\n🌎 \nAbout garden3d\nWe are a worker-owned creative collective, innovating on everything from brands and IRL communities to IoT devices and cross-platform apps. We share profit, open source everything, spin out new businesses, and invest in exciting ideas through financial and/or in-kind contributions.\nOur client roster includes Google, Stripe, Figma, Hinge, Black Socialists in America, ACLU, Pratt, Parsons, Mozilla, The Nobel Prize, MIT, Gnosis, Etsy & Gagosian. We’re the software team behind innovative products like The Light Phone & Mill, and we a global, decentralized community space collective called Index Space.\nWe think of our garden3d as collective for creative people, prioritizing a happy, talented, and diverse studio culture. We work on projects that bring value to our world, and we balance deep care for the work we do with a genuine curiosity about life outside of our jobs.\n🔮 \nWho we’re looking for:\nRight now, we’re looking for a \nSenior Elixir Engineer\n with expertise in web, backend and/or native app development, and interest in systems architecture and IoT.\nIn this role, you’ll work on a variety of client projects to find cost-effective, high-quality, pragmatic solutions to complex problems. You would work on \nfull-stack apps\n across many industries, from e-commerce to connected hardware products. Responsibilities will include:\nCrafting technical architecture plans through interfacing with clients to understand product requirements\nDeveloping and optimizing technical solutions while keeping in mind performance, scalability, maintainability, and cost-effectiveness\nParticipating in code reviews, providing constructive feedback to teammates and ensuring adherence to best practices\nContributing to project success by keeping a close eye on team velocity, project scope, budget, and timeline\nNegotiating with clients to align project scope with budget and timeline, if needed\nThe person we’re looking for is happy, relaxed and easy to get along with. They’re flexible on anything except conceits that will lower their usually outstanding work quality. They work “smart”, by carefully managing their workflow and staggering features that have dependencies intelligently — they prefer deep work but are OK coming up to the surface now and then for top level / strategic conversations.\nWe believe people with backgrounds or interests in design, art, music, food or fashion tend to have a well rounded sense of design & quality — so a variety of hobbies or side projects is a big nice to have!\n💸 Compensation\nOur pay scale ranges from \n$85 p/hr\n to \n$130 p/hr\n pending seniority (& team leadership experience), and our projects are rarely less than 8 full time weeks at 40 hours per week. Additionally, we pay discretionary bonuses for going over and above — like training & coaching others, winning new business, speaking at conferences, etc.\nWe prefer long standing relationships with highly accountable and communicative team members, so we encourage candidates to expect longer term engagements. A senior engineer working 40 — 45 full time weeks may take home \n$150k — $225k USD.\n🔑 \nMust Have Competencies:\nFluency in Elixir, and production experience maintaining Elixir Phoenix apps\n8+ years general experience in backend (Ruby on Rails, Elixir Phoenix, Python Django, or Node Express) and/or native app development (React Native, Flutter, Android, AOSP, Kotlin/Java).\nComfort with building performant and polished frontend applications (React, CSS, Accessibility, etc)\nExtensive experience with API Design and knowledge of REST and GraphQL, as well as authentication strategies with JWTs and OAuth 2.0.\nFluency in SQL & database operations, and extensive experience with one of PostgreSQL, MongoDB, MySQL or SQLite.\nFluency in HTTP, Caching, Status Codes, Security Standards and other Web protocols & patterns.\nExperience with AWS, GCP, or Azure and a core understanding of best practices such as IAM & credential management.\nProduction experience with PaaS providers such as Heroku, Render, Cloud66, Vercel, Elastic Beanstalk, EC2, Docker, or Gigalixir.\n💪 \nNice to Have Competencies:\nWe’re always pitching for new and exciting technology niches. Some of the areas below are relevant to us!\nFluency in Elixir LiveView or experience with Rails Hotwire\nExperience working with LLMs, Vector Databases, and other generalist AI-enabled application patterns\nProduct management experience, including defining product roadmaps and working closely with stakeholders.\nHands-on experience with Zenhub, Trello, Jira or similar.\nClient-facing experience, working directly with customers to gather requirements and provide technical solutions.\nEngineering management experience, including leading teams, setting technical direction, and mentoring developers.\nExperience in Hardware, Firmware, or Internet of Things (IoT).\nNative IDEs (Xcode, Android Studio), Languages & Low Level experience (Swift, Rust, C & C++, Clang & LLVM), Electron, V8 & NAN.\n🎤 \nHow we interview:\nOur interview process starts with a call where you get to meet a few members of our team. From there we’ll ask appropriate candidates to take part in a technical exercise which helps illustrate skill level and comfort.\n→ It’s also a great way to see what it’s like to work with us and help support folks who may not have the ‘right title’ but have the experience and technical know-how for the role.\n👩‍🏭 \nHow we work:\nWe believe that there’s a better balance between the poles of freelancing & full time, and for that reason Sanctuary works differently to most shops:\nTransparency & Ownership:\n We release out Profit & Loss statements to the community each year, open source our best ideas, and talk business & money with everyone in the company. We’re proud to run our business with integrity, and for that reason we share everything with our team & community.\n**150% Carbon Negative:\n** Our studio offsets 150% of the carbon we use to do business each year, dated back to our founding in 2015. We turn down work that is not in-line with our morals, and we encourage our peers to do the same. \nWe were certified climate neutral earlier this year\n.\n**Strong Morals:\n** Since our founding, we've turned down somewhere between $1mm - $2mm of work that didn't meet our moral standards. (Most of that was DTC brands that can't show a valid sustainability initiative).\nAsync & Decentralized:\n We use tools optimized for calm, thoughtful communication, and opt for async whenever possible. We fight hard to maintain our focus time.\nRemote Friendly:\n Our company is fluent in remote work, making our workplace more decentralized, and democratized in the process.\nIdeas & Products:\n In our spare studio time, we work to build our own open source or internal products to diversify & bolster our income. We create amazing technology products for our clients, so why not for the studio?\n→ Read more on our \nSubstack, over here\n, or our \nMedium, over there\n.\nPlease click this Important link below or copy the URL (Same as the apply button) to proceed with your application by telling us a bit more about your interest in the role:\ngarden3d Creative Form\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlease mention the word \nDISTINCTIVE\n when applying to show you read the job post completely (#RMzQuNDYuMjM3LjIzMw==). This is a feature to avoid fake spam applicants. Companies can search these words to find applicants that read this and instantly see they're human.\n\n\n \nSalary and compensation\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $150,000 — $220,000/year\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\nBenefits\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t🌎 Distributed team\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t⏰ Async",
        "years_of_experience": "N/A",
        "date_posted": "6d",
        "work_type": "Remote",
        "annual_base": "N/A",
        "type": "N/A",
        "level": "N/A"
    }
]